## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:108" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:108" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:941fef6cb5f98fb9151d26a95cf756ccd98ed76538e279ac9128c2375cde7ada" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:1e51d007c00ba56b2b6307453e434896129ee3690b4314cc3febd04b0698f71f"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 108 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "52cd10c00a86a88fca143e75a8224e0a-6" -> "76a730885efd82da17257019ae006cb0"
        id                     = "graphql.76a730885efd82da17257019ae006cb0.zip"
        tags                   = {}
      ~ version_id             = "g22LTWIaFVAnV4fnnT.CHCBuRdDlYpOd" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8f97754056f316a801dfefa7a96cc67e-5" -> "0f990cba3fe4ecb7aa57e3238c68fa76"
      ~ id                     = "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" -> (known after apply)
      ~ key                    = "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" -> "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "3d046486c7ff1f36316f2ad3ab262e5d" -> "0f990cba3fe4ecb7aa57e3238c68fa76"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "cryubljiR0bR8vxgoT.mCOPprCaGfYa0" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.654a82cf655f8f8a65eed386d5aff5b0.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cd440eb21ef0391b09f83b5ee3b9048d-4" -> "8191372d30eec3206c234ec72ad8251d"
      ~ id                     = "python.654a82cf655f8f8a65eed386d5aff5b0.zip" -> (known after apply)
      ~ key                    = "python.654a82cf655f8f8a65eed386d5aff5b0.zip" -> "python.8191372d30eec3206c234ec72ad8251d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "654a82cf655f8f8a65eed386d5aff5b0" -> "8191372d30eec3206c234ec72ad8251d"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "uHpRX8cs2.I7GaR2xN.bxZA6jpP2lRwt" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "44e4b09e10d9dc390863d0388aebcb9a" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/200.html"
      ~ source_hash            = "44e4b09e10d9dc390863d0388aebcb9a" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "7qic5KNj8KtwNj8pnn_DSY98C1s09ic4" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1965a8e5c3594dbc0155ae1887a5121c" -> "e1c218f420fde98b47676202acec58b8"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "1965a8e5c3594dbc0155ae1887a5121c" -> "e1c218f420fde98b47676202acec58b8"
        tags                   = {}
      ~ version_id             = "QfeZLbNfSwBVae6LILvrtBr4Ed283410" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "af878cce08e9bad8d1a8852ca56452aa" -> "4e80e6bbd4aac287444ca0f6764923dc"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "af878cce08e9bad8d1a8852ca56452aa" -> "4e80e6bbd4aac287444ca0f6764923dc"
        tags                   = {}
      ~ version_id             = "xOtbrNdP.1ZIphOIZXbDyc3pKOJcML2t" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "44e4b09e10d9dc390863d0388aebcb9a" -> "2c03c36cf6a6703795834d177648867a"
        id                     = "dist/index.html"
      ~ source_hash            = "44e4b09e10d9dc390863d0388aebcb9a" -> "2c03c36cf6a6703795834d177648867a"
        tags                   = {}
      ~ version_id             = "KzVoFdBvCgY4V0qtE92suC2NO8tvIEvG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8920f20d.js"] will be destroyed
  # (because key ["static/js/app.8920f20d.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.8920f20d.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "47d60cc49b19ee0bad7806e35ea607ea" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8920f20d.js" -> null
-       key                    = "dist/static/js/app.8920f20d.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8920f20d.js" -> null
-       source_hash            = "47d60cc49b19ee0bad7806e35ea607ea" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "wb1CZGFjZKITGfypE4uT8qYe43S8Kzqw" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.8920f20d.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.8920f20d.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.8920f20d.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.8920f20d.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.8920f20d.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.8920f20d.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9OPtenP7a_rf2pgi.5X3g._P8O0FzJCL" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-22T19:04:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:75" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:75/invocations" -> (known after apply)
      ~ s3_key                         = "python.654a82cf655f8f8a65eed386d5aff5b0.zip" -> "python.8191372d30eec3206c234ec72ad8251d.zip"
        tags                           = {}
      ~ version                        = "75" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
              ~ "DD_TAGS"                      = "git.commit.sha:0dfeb65c810c4fda330f05ba37e7f5849aba8a5c,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:91d8b27f2076816fe8a8691bd8a6be5365fdc107,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "75" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:123" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:123/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "123" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
              ~ "DD_TAGS"                            = "git.commit.sha:0dfeb65c810c4fda330f05ba37e7f5849aba8a5c,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:91d8b27f2076816fe8a8691bd8a6be5365fdc107,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "123" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ last_modified                  = "2024-04-22T19:04:05.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:31" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:31/invocations" -> (known after apply)
      ~ s3_key                         = "processValidationJson.3d046486c7ff1f36316f2ad3ab262e5d.zip" -> "processValidationJson.0f990cba3fe4ecb7aa57e3238c68fa76.zip"
        tags                           = {}
      ~ version                        = "31" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
              ~ "DD_TAGS"                            = "git.commit.sha:0dfeb65c810c4fda330f05ba37e7f5849aba8a5c,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:91d8b27f2076816fe8a8691bd8a6be5365fdc107,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "0dfeb65c810c4fda330f05ba37e7f5849aba8a5c" -> "91d8b27f2076816fe8a8691bd8a6be5365fdc107"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "31" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 8 to add, 9 to change, 8 to destroy.
```

</details>

*Pusher: @as1729, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8789632242)*